{
    "Resource": "users",
    "Endpoints": {
        "GET users/lookup": {
            "Function": "Get-TwitterUserList",
            "ApiVersion": "v1.1",
            "OAuthVersion": "1.0a",
            "Resource": "users/lookup",
            "Method": "GET",
            "Uri": "https://api.twitter.com/1.1/users/lookup.json",
            "ApiReference": "https://developer.twitter.com/en/docs/twitter-api/v1/accounts-and-users/follow-search-get-users/api-reference/get-users-lookup",
            "Description": "Returns fully-hydrated user objects for up to 100 users per request, as specified by comma-separated values passed to the user_id and/or screen_name parameters.\nThis method is especially useful when used in conjunction with collections of user IDs returned from GET friends / ids and GET followers / ids.\nGET users / show is used to retrieve a single user object.\nThere are a few things to note when using this method.\nYou must be following a protected user to be able to see their most recent status update. If you don't follow a protected user their status will be removed.\nThe order of user IDs or screen names may not match the order of users in the returned array.\nIf a requested user is unknown, suspended, or deleted, then that user will not be returned in the results list.\nIf none of your lookup criteria can be satisfied by returning a user object, a HTTP 404 will be thrown.\nYou are strongly encouraged to use a POST for larger requests.",
            "Iteration": "None",
            "Parameters": [
                {
                    "Name": "screen_name",
                    "PSParameter": "ScreenName",
                    "Implemented": true,
                    "Required": "optional",
                    "Description": "A comma separated list of screen names, up to 100 are allowed in a single request. You are strongly encouraged to use a POST for larger (up to 100 screen names) requests.",
                    "DefaultValue": null,
                    "Example": "twitterapi,twitter"
                },
                {
                    "Name": "user_id",
                    "PSParameter": "UserId",
                    "Implemented": true,
                    "Required": "optional",
                    "Description": "A comma separated list of user IDs, up to 100 are allowed in a single request. You are strongly encouraged to use a POST for larger requests.",
                    "DefaultValue": null,
                    "Example": "783214,6253282"
                },
                {
                    "Name": "include_entities",
                    "PSParameter": "ExcludeEntities",
                    "Implemented": true,
                    "Required": "optional",
                    "Description": "The entities node that may appear within embedded statuses will not be included when set to false.",
                    "DefaultValue": null,
                    "Example": "example of parameter 2"
                },
                {
                    "Name": "tweet_mode",
                    "PSParameter": null,
                    "Implemented": false,
                    "Required": "optional",
                    "Description": "Valid request values are compat and extended, which give compatibility mode and extended mode, respectively for Tweets that contain over 140 characters",
                    "DefaultValue": "extended",
                    "Example": "compat"
                }
            ]
        }
    }
}