{
    "Resource": "statuses",
    "Endpoints": {
        "POST statuses/update": {
            "Function": "Publish-Tweet",
            "ApiVersion": "v1.1",
            "Resource": "statuses/update",
            "Method": "POST",
            "Uri": "https://api.twitter.com/1.1/statuses/update.json",
            "ApiReference": "https://developer.twitter.com/en/docs/twitter-api/v1/tweets/post-and-engage/api-reference/post-statuses-update",
            "Description": "Updates the authenticating user's current status, also known as Tweeting.\nFor each update attempt, the update text is compared with the authenticating user's recent Tweets. Any attempt that would result in duplication will be blocked, resulting in a 403 error. A user cannot submit the same status twice in a row.\nWhile not rate limited by the API, a user is limited in the number of Tweets they can create at a time. If the number of updates posted by the user reaches the current allowed limit this method will return an HTTP 403 error.",
            "Iteration": "None",
            "Parameters": [
                {
                    "Name": "status",
                    "PSParameter": "TweetText",
                    "Implemented": true,
                    "Required": "required",
                    "Description": "The text of the status update. URL encode as necessary. t.co link wrapping will affect character counts.",
                    "DefaultValue": null,
                    "MinValue": "minimum value",
                    "MaxValue": "maximum value",
                    "Example": "Hello World!"
                },
                {
                    "Name": "in_reply_to_status_id",
                    "PSParameter": "ReplyToTweeet",
                    "Implemented": true,
                    "Required": "optional",
                    "Description": "The ID of an existing status that the update is in reply to. Note: This parameter will be ignored unless the author of the Tweet this parameter references is mentioned within the status text. Therefore, you must include @username , where username is the author of the referenced Tweet, within the update.",
                    "DefaultValue": null,
                    "Example": 1234567890
                },
                {
                    "Name": "auto_populate_reply_metadata",
                    "PSParameter": null,
                    "Implemented": true,
                    "Required": "optional",
                    "Description": "If set to true and used with in_reply_to_status_id, leading @mentions will be looked up from the original Tweet, and added to the new Tweet from there. This wil append @mentions into the metadata of an extended Tweet as a reply chain grows, until the limit on @mentions is reached. In cases where the original Tweet has been deleted, the reply will fail.",
                    "DefaultValue": false,
                    "Example": true
                },
                {
                    "Name": "exclude_reply_user_ids",
                    "PSParameter": null,
                    "Implemented": true,
                    "Required": "optional",
                    "Description": "When used with auto_populate_reply_metadata, a comma-separated list of user ids which will be removed from the server-generated @mentions prefix on an extended Tweet. Note that the leading @mention cannot be removed as it would break the in-reply-to-status-id semantics. Attempting to remove it will be silently ignored.",
                    "DefaultValue": null,
                    "Example": "786491,54931584"
                },
                {
                    "Name": "attachment_url",
                    "PSParameter": null,
                    "Implemented": true,
                    "Required": "optional",
                    "Description": "In order for a URL to not be counted in the status body of an extended Tweet, provide a URL as a Tweet attachment. This URL must be a Tweet permalink, or Direct Message deep link. Arbitrary, non-Twitter URLs must remain in the status text. URLs passed to the attachment_url parameter not matching either a Tweet permalink or Direct Message deep link will fail at Tweet creation and cause an exception.",
                    "DefaultValue": null,
                    "Example": "https://twitter.com/andypiper/status/903615884664725505"
                },
                {
                    "Name": "media_ids",
                    "PSParameter": "MediaId",
                    "Implemented": true,
                    "Required": "optional",
                    "Description": "A comma-delimited list of media_ids to associate with the Tweet. You may include up to 4 photos or 1 animated GIF or 1 video in a Tweet. See Uploading Media for further details on uploading media.",
                    "DefaultValue": null,
                    "Example": "471592142565957632"
                },
                {
                    "Name": "possibly_sensitive",
                    "PSParameter": "Sensitive",
                    "Implemented": false,
                    "Required": "optional",
                    "Description": "If you upload Tweet media that might be considered sensitive content such as nudity, or medical procedures, you must set this value to true. See Media setting and best practices for more context.",
                    "DefaultValue": false,
                    "Example": true
                },
                {
                    "Name": "lat",
                    "PSParameter": null,
                    "Implemented": false,
                    "Required": "optional",
                    "Description": "The latitude of the location this Tweet refers to. This parameter will be ignored unless it is inside the range -90.0 to +90.0 (North is positive) inclusive. It will also be ignored if there is no corresponding long parameter.",
                    "DefaultValue": null,
                    "Example": "37.7821120598956"
                },
                {
                    "Name": "long",
                    "PSParameter": null,
                    "Implemented": false,
                    "Required": "optional",
                    "Description": "The longitude of the location this Tweet refers to. The valid ranges for longitude are -180.0 to +180.0 (East is positive) inclusive. This parameter will be ignored if outside that range, if it is not a number, if geo_enabled is turned off, or if there no corresponding lat parameter.",
                    "DefaultValue": null,
                    "Example": "-122.400612831116"
                },
                {
                    "Name": "place_id",
                    "PSParameter": "Place",
                    "Implemented": false,
                    "Required": "optional",
                    "Description": "A place in the world.",
                    "DefaultValue": null,
                    "Example": "df51dec6f4ee2b2c"
                },
                {
                    "Name": "display_coordinates",
                    "PSParameter": null,
                    "Implemented": false,
                    "Required": "optional",
                    "Description": "Whether or not to put a pin on the exact coordinates a Tweet has been sent from.",
                    "DefaultValue": null,
                    "Example": true
                },
                {
                    "Name": "trim_user",
                    "PSParameter": null,
                    "Implemented": false,
                    "Required": "optional",
                    "Description": "When set to either true , t or 1 , the response will include a user object including only the author's ID. Omit this parameter to receive the complete user object.",
                    "DefaultValue": false,
                    "Example": true
                },
                {
                    "Name": "enable_dmcommands",
                    "PSParameter": null,
                    "Implemented": false,
                    "Required": "optional",
                    "Description": "When set to true, enables shortcode commands for sending Direct Messages as part of the status text to send a Direct Message to a user. When set to false, it turns off this behavior and includes any leading characters in the status text that is posted.",
                    "DefaultValue": false,
                    "Example": true
                },
                {
                    "Name": "fail_dmcommands",
                    "PSParameter": null,
                    "Implemented": false,
                    "Required": "optional",
                    "Description": "When set to true, causes any status text that starts with shortcode commands to return an API error. When set to false, allows shortcode commands to be sent in the status text and acted on by the API.",
                    "DefaultValue": true,
                    "Example": false
                },
                {
                    "Name": "card_uri",
                    "PSParameter": null,
                    "Implemented": false,
                    "Required": "optional",
                    "Description": "Associate an ads card with the Tweet using the card_uri value from any ads card response.",
                    "DefaultValue": null,
                    "Example": "card://853503245793641682"
                }
            ]
        }
    }
}